//
//  dataModel.swift
//  SwiftUI_Project
//
//  Created by Егор Голубев on 04.08.2025.
//

import SwiftUI

let posts = [
    Post(id: 1,
        title: "1 + 1",
         description: "Аристократ на коляске нанимает в сиделки бывшего заключенного. Искрометная французская комедия с Омаром Си",
         image: Image("image_1")),
    
    Post(id: 2,
        title: "Интерстеллар",
         description: "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
         image: Image("image_2")),
    
    Post(id: 3,
        title: "Побег из Шоушенка",
         description: "Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.",
         image: Image("image_3"))
]
